hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/i2c.h
//###########################################################################
//
// FILE:   i2c.h
//
// TITLE:  CM I2C driver.
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright: $
//###########################################################################

#ifndef I2C_H
#define I2C_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup i2c_api I2C
//! @{
//
//*****************************************************************************

#include "inc_cm/hw_i2c.h"
#include "inc_cm/hw_memmap.h"
#include "inc_cm/hw_types.h"
#include "interrupt.h"
#include "debug.h"

//*****************************************************************************
//
// Defines for the API.
//
//*****************************************************************************
//*****************************************************************************
//
//Values that can be returned from I2C_getMasterErr() as I2C Master error
//status  
//
//*****************************************************************************
#define I2C_MASTER_ERR_NONE     0X00000000U  // No error
#define I2C_MASTER_ERR_ADDR_ACK 0x00000004U  // Acknowledge Address error
#define I2C_MASTER_ERR_DATA_ACK 0x00000008U  // Acknowledge Data error
#define I2C_MASTER_ERR_ARB_LOST 0x00000010U  // Arbitration Lost error
#define I2C_MASTER_ERR_CLK_TOUT 0x00000080U  // Clock Timeout error

//*****************************************************************************
//
// Values that can be passed to I2C_enableMasterIntSource() as I2C Master 
// interrupts 
//
//*****************************************************************************
#define I2C_MASTER_INT_RX_FIFO_FULL   0x00000800U  //!< RX FIFO Full Interrupt
#define I2C_MASTER_INT_TX_FIFO_EMPTY  0x00000400U  //!< TX FIFO Empty Intrpt
#define I2C_MASTER_INT_RX_FIFO_REQ    0x00000200U  //!< RX FIFO Request Intrpt
#define I2C_MASTER_INT_TX_FIFO_REQ    0x00000100U  //!< TX FIFO Request Intrpt
#define I2C_MASTER_INT_ARB_LOST       0x00000080U  //!< Arb Lost Interrupt
#define I2C_MASTER_INT_STOP           0x00000040U  //!< Stop Condition Intrpt
#define I2C_MASTER_INT_START          0x00000020U  //!< Start Condition Intrpt
#define I2C_MASTER_INT_NACK           0x00000010U  //!< Addr/Data NACK Intrpt
#define I2C_MASTER_INT_TX_DMA_DONE    0x00000008U  //!< TX DMA Complete Intrpt
#define I2C_MASTER_INT_RX_DMA_DONE    0x00000004U  //!< RX DMA Complete Intrpt
#define I2C_MASTER_INT_TIMEOUT        0x00000002U  //!< Clock Timeout Intrpt
#define I2C_MASTER_INT_DATA           0x00000001U  //!< Data Interrupt

//*****************************************************************************
//
// Values that are returned from I2C_getSlaveStatus() as I2C Slave 
// action requests
//
//*****************************************************************************
#define I2C_SLAVE_ACT_NONE      0x00000000U  // Master has sent no command
#define I2C_SLAVE_ACT_RREQ      0x00000001U  // Master has sent data
#define I2C_SLAVE_ACT_TREQ      0x00000002U  // Master has requested data
#define I2C_SLAVE_ACT_RREQ_FBR  0x00000005U  // Master has sent first byte
#define I2C_SLAVE_ACT_OWN2SEL   0x00000008U  // Master requested secondary
                                             // slave
#define I2C_SLAVE_ACT_QCMD      0x00000010U  // Master has sent Quick Command
#define I2C_SLAVE_ACT_QCMD_DATA 0x00000020U  // Master Quick Command value

//*****************************************************************************
//
// Values that are returned from I2C_getSlaveStatus() as I2C DMA status 
//
//*****************************************************************************
#define I2C_SLAVE_DMA_TX    0x00000040U  // DMA TX active 
#define I2C_SLAVE_DMA_RX    0x00000080U  // DMA RX active 

//*****************************************************************************
//
// Miscellaneous I2C driver definitions.
//
//*****************************************************************************
#define I2C_MASTER_MAX_RETRIES    1000U        // Number of retries

#define I2C_SA_A6_0_MASK          0x80U          //Mask for Slave Address A6-0
#define I2C_TXFIFO_MASK           0xffff0000U    //TX FIFO Mask
#define I2C_RXFIFO_MASK           0x0000ffffU    //RX FIFO Mask
#define I2C_SCL_FREQ_FAST_MODE    400000U        //SCL freq Fast mode 
#define I2C_SCL_FREQ_STD_MODE     100000U        //SCL freq Std mode
#define I2C_SCL_FREQ_HS_MODE      3400000U       //SCL freq High speed mode

//*****************************************************************************
//
// Values that can be passed to I2C_enableSlaveIntSource() as I2C Slave 
// interrupts
//
//*****************************************************************************
#define I2C_SLAVE_INT_RX_FIFO_FULL     0x00000100U  //!< RX FIFO Full Intrpt
#define I2C_SLAVE_INT_TX_FIFO_EMPTY    0x00000080U  //!< TX FIFO Empty Intrpt
#define I2C_SLAVE_INT_RX_FIFO_REQ      0x00000040U  //!< RX FIFO Req Intrpt
#define I2C_SLAVE_INT_TX_FIFO_REQ      0x00000020U  //!< TX FIFO Req Intrpt
#define I2C_SLAVE_INT_TX_DMA_DONE      0x00000010U  //!< TX DMA Complete Intrpt
#define I2C_SLAVE_INT_RX_DMA_DONE      0x00000008U  //!< RX DMA Complete Intrpt
#define I2C_SLAVE_INT_STOP             0x00000004U  //!< Stop Condition Intrpt
#define I2C_SLAVE_INT_START            0x00000002U  //!< Start Condition Intrpt
#define I2C_SLAVE_INT_DATA             0x00000001U  //!< Data Interrupt  

//*****************************************************************************
//
// Values that can be passed to I2C_enableFIFO() for I2C FIFO configuration 
//
//*****************************************************************************
#define I2C_SLAVE_TX_FIFO_ENABLE          0x00000002U //!< TX FIFO enable 
#define I2C_SLAVE_RX_FIFO_ENABLE          0x00000004U //!< RX FIFO enable

//*****************************************************************************
//
// Values that can be passed to I2C_configureSlaveAckOverride() as  I2C Slave 
// Ack override enable/Disable configuration
//
//*****************************************************************************
#define I2C_SLAVE_ACK_OVERRIDE_ENABLE    true  //!<Slave ACK override enable
#define I2C_SLAVE_ACK_OVERRIDE_DISABLE   false //!<Slave ACK override disable

//*****************************************************************************
//
// Values that can be passed to I2C_setSlaveAckValue() for I2C 
// Slave Ack / Nack configuration
//
//*****************************************************************************
#define I2C_SLAVE_ACK     true    //!<Slave ACK
#define I2C_SLAVE_NACK    false   //!<Slave NACK

//*****************************************************************************
//
// Values that are returned from I2C_getTxFIFOStatus() & I2C_getRxFIFOStatus()
// as I2C FIFO status
//
//*****************************************************************************
#define I2C_FIFO_RX_BELOW_TRIG_LEVEL     0x00040000U  //RX FIFO below Trigger 
                                                      //level
#define I2C_FIFO_RX_FULL                 0x00020000U  //RX FIFO Full
#define I2C_FIFO_RX_EMPTY                0x00010000U  //RX FIFO Empty
#define I2C_FIFO_TX_BELOW_TRIG_LEVEL     0x00000004U  //TX FIFO below Trigger 
                                                      //level
#define I2C_FIFO_TX_FULL                 0x00000002U  //TX FIFO Full
#define I2C_FIFO_TX_EMPTY                0x00000001U  //TX FIFO Empty

#define I2C_FIFOSTATUS_TX_M              0x00000007U //TX FIFO mask
#define I2C_FIFOSTATUS_RX_M              0x00070000U //RX FIFO mask

//*****************************************************************************
//
// Values that can be passed to I2C_initMaster() as I2C clock frequency in Hz
//
//*****************************************************************************
#define I2C_CLK_FREQ                CM_CLK_FREQ    //!<CM CPU freq 

//*****************************************************************************
//
// Values that can be passed to I2C_isMasterIntActive(),
// I2C_getMasterIntStatus(),I2C_isSlaveIntActive() & 
// I2C_getSlaveIntStatus() as I2C interrupt type 
//
//*****************************************************************************

#define I2C_MASTER_RAW_INT             false //!<raw interrupt
#define I2C_MASTER_MASKED_INT          true  //!<masked interrupt
typedef bool I2C_MasterIntType;    

//*****************************************************************************
//
// Values that can be passed to I2C_setSlaveAddress() to select 
// I2C Master Read / write 
//
//*****************************************************************************
typedef enum
{
    I2C_MASTER_WRITE        = 0x00U, //!<Master Read from slave
    I2C_MASTER_READ         = 0x01U  //!<Master write to slave

} I2C_MasterRW;

//*****************************************************************************
//
// Values that can be passed to I2C_setOwnSlaveAddress() for I2C Slave
// Address configuration
//
//*****************************************************************************

