hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/i2c.h
typedef enum
{
    I2C_SLAVE_ADDR_PRIMARY          = 0x00U, //!<primary address
    I2C_SLAVE_ADDR_SECONDARY        = 0x01U  //!<secondary address

} I2C_SlaveAddrmode;

//*****************************************************************************
//
// Values that can be passed to I2C_setMasterConfig() as I2C Master commands
//
//*****************************************************************************

typedef enum
{
  I2C_MASTER_CMD_SINGLE_SEND                   = 0x00000007U, //!<SINGLE SEND
  I2C_MASTER_CMD_SINGLE_RECEIVE                = 0x00000007U, //!<SINGLE RECV
  I2C_MASTER_CMD_BURST_SEND_START              = 0x00000003U, //!<BURST SEND START                                                          
  I2C_MASTER_CMD_BURST_SEND_CONT               = 0x00000001U, //!<BURST SEND CONT
  I2C_MASTER_CMD_BURST_SEND_FINISH             = 0x00000005U, //!<BURST SEND FINISH
  I2C_MASTER_CMD_BURST_SEND_STOP               = 0x00000004U, //!<BURST SEND STOP
  I2C_MASTER_CMD_BURST_SEND_ERROR_STOP         = 0x00000004U, //!<BURST SEND ERROR_STOP
  I2C_MASTER_CMD_BURST_RECEIVE_START           = 0x0000000bU, //!<BURST RECEIVE START
  I2C_MASTER_CMD_BURST_RECEIVE_CONT            = 0x00000009U, //!<BURST RECEIVE CONT
  I2C_MASTER_CMD_BURST_RECEIVE_FINISH          = 0x00000005U, //!<BURST RECEIVE FINISH
  I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP      = 0x00000004U, //!<BURST RECEIVE ERROR STOP
  I2C_MASTER_CMD_QUICK_COMMAND                 = 0x00000027U, //!<QUICK COMMAND
  I2C_MASTER_CMD_HS_MASTER_CODE_SEND           = 0x00000013U, //!<HS MASTER CODE SEND
  I2C_MASTER_CMD_FIFO_SINGLE_SEND              = 0x00000046U, //!<FIFO SINGLE SEND 
  I2C_MASTER_CMD_FIFO_SINGLE_RECEIVE           = 0x00000046U, //!<FIFO SINGLE RECEIVE
  I2C_MASTER_CMD_FIFO_BURST_SEND_START         = 0x00000042U, //!<FIFO BURST SEND START
  I2C_MASTER_CMD_FIFO_BURST_SEND_CONT          = 0x00000040U, //!<FIFO BURST SEND CONT
  I2C_MASTER_CMD_FIFO_BURST_SEND_FINISH        = 0x00000044U, //!<FIFO BURST SEND FINISH
  I2C_MASTER_CMD_FIFO_BURST_SEND_ERROR_STOP    = 0x00000004U, //!<BURST SEND ERROR STOP
  I2C_MASTER_CMD_FIFO_BURST_RECEIVE_START      = 0x0000004aU, //!<BURST RECEIVE START
  I2C_MASTER_CMD_FIFO_BURST_RECEIVE_CONT       = 0x00000048U, //!<BURST RECEIVE CONT
  I2C_MASTER_CMD_FIFO_BURST_RECEIVE_FINISH     = 0x00000044U, //!<FIFO BURST RECEIVE FINISH
  I2C_MASTER_CMD_FIFO_BURST_RECEIVE_ERROR_STOP = 0x00000004U  //!<FIFO BURST RECEIVE ERROR STOP

} I2C_MasterControl;

//*****************************************************************************
//
// Values that can be passed to I2C_configureMasterGlitchFilter() as I2C 
// Master glitch filter configuration
//
//*****************************************************************************
typedef enum
{
    I2C_MASTER_GLITCH_FILTER_DISABLED    = 0x00000000U,      //!< Bypass
    I2C_MASTER_GLITCH_FILTER_1           = 0x00010000U,      //!< 1 clock 
    I2C_MASTER_GLITCH_FILTER_2           = 0x00020000U,      //!< 2 clocks 
    I2C_MASTER_GLITCH_FILTER_3           = 0x00030000U,      //!< 3 clocks 
    I2C_MASTER_GLITCH_FILTER_4           = 0x00040000U,      //!< 4 clocks 
    I2C_MASTER_GLITCH_FILTER_8           = 0x00050000U,      //!< 8 clocks 
    I2C_MASTER_GLITCH_FILTER_16          = 0x00060000U,      //!< 16 clocks 
    I2C_MASTER_GLITCH_FILTER_31          = 0x00070000U       //!< 31 clocks 
    
} I2C_GlitchFilter;

//*****************************************************************************
//
//  Values that can be passed to I2C_configureTxFIFO()for I2C FIFO configuring 
//
//*****************************************************************************

typedef enum
{
    I2C_FIFO_CFG_TX_MASTER              = 0x00000000U, //!< TX Master
    I2C_FIFO_CFG_TX_SLAVE               = 0x00008000U, //!< TX slave
    I2C_FIFO_CFG_TX_MASTER_DMA          = 0x00002000U, //!< TX Master DMA 
    I2C_FIFO_CFG_TX_SLAVE_DMA           = 0x0000a000U  //!< TX slave DMA
    
} I2C_TxFIFOCfg;

typedef enum
{
  I2C_FIFO_CFG_TX_NO_TRIG = 0x00000000U, //!< Trigger when TX FIFO empty
  I2C_FIFO_CFG_TX_TRIG_1  = 0x00000001U, //!< Trigger when TX FIFO has 1 byte 
  I2C_FIFO_CFG_TX_TRIG_2  = 0x00000002U, //!< Trigger when TX FIFO has 2 byte
  I2C_FIFO_CFG_TX_TRIG_3  = 0x00000003U, //!< Trigger when TX FIFO has 3 byte
  I2C_FIFO_CFG_TX_TRIG_4  = 0x00000004U, //!< Trigger when TX FIFO has 4 byte
  I2C_FIFO_CFG_TX_TRIG_5  = 0x00000005U, //!< Trigger when TX FIFO has 5 byte
  I2C_FIFO_CFG_TX_TRIG_6  = 0x00000006U, //!< Trigger when TX FIFO has 6 byte
  I2C_FIFO_CFG_TX_TRIG_7  = 0x00000007U  //!< Trigger when TX FIFO has 7 byte

} I2C_TxTrigger;

//*****************************************************************************
//
//Values that can be passed to I2C_configureRxFIFO() for I2C FIFO configuring
//
//*****************************************************************************

typedef enum
{
    I2C_FIFO_CFG_RX_MASTER          = 0x00000000U, //!< RX Master
    I2C_FIFO_CFG_RX_SLAVE           = 0x80000000U, //!< RX slave
    I2C_FIFO_CFG_RX_MASTER_DMA      = 0x20000000U, //!< RX Master DMA 
    I2C_FIFO_CFG_RX_SLAVE_DMA       = 0xa0000000U  //!< RX slave DMA

} I2C_RxFIFOCfg;

typedef enum
{
  I2C_FIFO_CFG_RX_NO_TRIG = 0x00000000U, //!< Trigger when RX FIFO empty
  I2C_FIFO_CFG_RX_TRIG_1  = 0x00010000U, //!< Trigger when RX FIFO has 1 byte 
  I2C_FIFO_CFG_RX_TRIG_2  = 0x00020000U, //!< Trigger when RX FIFO has 2 byte 
  I2C_FIFO_CFG_RX_TRIG_3  = 0x00030000U, //!< Trigger when RX FIFO has 3 byte  
  I2C_FIFO_CFG_RX_TRIG_4  = 0x00040000U, //!< Trigger when RX FIFO has 4 byte 
  I2C_FIFO_CFG_RX_TRIG_5  = 0x00050000U, //!< Trigger when RX FIFO has 5 byte 
  I2C_FIFO_CFG_RX_TRIG_6  = 0x00060000U, //!< Trigger when RX FIFO has 6 byte 
  I2C_FIFO_CFG_RX_TRIG_7  = 0x00070000U  //!< Trigger when RX FIFO has 7 byte 

} I2C_RxTrigger;



//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks an I2C base address.
//!
//! \param base is the base address of the I2C instance used.
//!
//! This function determines if a I2C module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
I2C_isBaseValid(uint32_t base)
{
    return(base == I2C0_BASE);
}
#endif

//*****************************************************************************
//
//! Enables the I2C Master block.
//!
//! \param base is the base address of the I2C module.
//!
//! This function enables operation of the I2C Master block.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_enableMaster(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable the master block.
    //
    HWREG(base + I2C_O_MCR) |= I2C_MCR_MFE;
}

//*****************************************************************************
//
//! Enables the I2C Slave block.
//!
//! \param base is the base address of the I2C module.
//!
//! This function enables operation of the I2C Slave block.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_enableSlave(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable the clock to the slave block.
    //
    HWREG(base + I2C_O_MCR) |= I2C_MCR_SFE;

    //
    // Enable the slave.
    //
    HWREG(base + I2C_O_SCSR_WRITE) = I2C_SCSR_WRITE_DA;
}

//*****************************************************************************
//
//! Initializes the I2C Slave block.
//!
//! \param base is the base address of the I2C module.
//! \param slaveAddr 7-bit slave address
//!
//! This function initializes operation of the I2C Slave block by configuring
//! the slave address and enabling the I2C Slave block.
//!
//! The parameter \e slaveAddr is the value that is compared against the
//! slave address sent by an I2C master.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_initSlave(uint32_t base, uint8_t slaveAddr)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));
    ASSERT(!(slaveAddr & I2C_SA_A6_0_MASK));

    //
    // Must enable the device before doing anything else.
    //
    I2C_enableSlave(base);

    //
    // Set up the slave address.
    //
    HWREG(base + I2C_O_SOAR) = slaveAddr;
}

//*****************************************************************************
//
//! Disables the I2C master block.
//!
//! \param base is the base address of the I2C module.
//!
//! This function disables operation of the I2C master block.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_disableMaster(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Disable the master block.
    //
    HWREG(base + I2C_O_MCR) &= ~(I2C_MCR_MFE);
}

//*****************************************************************************
//
//! Disables the I2C slave block.
//!
//! \param base is the base address of the I2C module.
//!
//! This function disables operation of the I2C slave block.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_disableSlave(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Disable the slave.
    //
    HWREG(base + I2C_O_SCSR_WRITE) &= ~I2C_SCSR_WRITE_DA ;

    //
    // Disable the clock to the slave block.
    //
    HWREG(base + I2C_O_MCR) &= ~(I2C_MCR_SFE);
}

//*****************************************************************************
//
//! Enables the I2C Master interrupt.
//!
//! \param base is the base address of the I2C module.
//!
//! This function enables the I2C Master interrupt source.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_enableMasterInt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable the master interrupt.
    //
    HWREG(base + I2C_O_MIMR) |= I2C_MASTER_INT_DATA;
}

//*****************************************************************************
//
//! Enables individual I2C Master interrupt sources.
//!
//! \param base is the base address of the I2C module.
//! \param intFlags is the bit mask of the interrupt sources to be enabled.
//!
//! This function enables the indicated I2C Master interrupt sources.  Only the
//! sources that are enabled can be reflected to the processor interrupt
//! disabled sources have no effect on the processor.
//!
//! The \e intFlags parameter is the logical OR of any of the following:
//!
//! - \b I2C_MASTER_INT_RX_FIFO_FULL - RX FIFO Full interrupt
//! - \b I2C_MASTER_INT_TX_FIFO_EMPTY - TX FIFO Empty interrupt
//! - \b I2C_MASTER_INT_RX_FIFO_REQ - RX FIFO Request interrupt
//! - \b I2C_MASTER_INT_TX_FIFO_REQ - TX FIFO Request interrupt
//! - \b I2C_MASTER_INT_ARB_LOST - Arbitration Lost interrupt
//! - \b I2C_MASTER_INT_STOP - Stop Condition interrupt
//! - \b I2C_MASTER_INT_START - Start Condition interrupt
//! - \b I2C_MASTER_INT_NACK - Address/Data NACK interrupt
//! - \b I2C_MASTER_INT_TX_DMA_DONE - TX DMA Complete interrupt
//! - \b I2C_MASTER_INT_RX_DMA_DONE - RX DMA Complete interrupt
//! - \b I2C_MASTER_INT_TIMEOUT - Clock Timeout interrupt
//! - \b I2C_MASTER_INT_DATA - Data interrupt
//!
//! \note Please consult the device data sheet to determine if these
//! features are supported.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_enableMasterIntSource(uint32_t base, uint32_t intFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable the master interrupt.
    //
    HWREG(base + I2C_O_MIMR) |= intFlags;
}

//*****************************************************************************
//
//! Enables the I2C Slave interrupt.
//!
//! \param base is the base address of the I2C module.
//!
//! This function enables the I2C Slave interrupt source.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_enableSlaveInt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable the slave interrupt.
    //
    HWREG(base + I2C_O_SIMR) |= I2C_SLAVE_INT_DATA;
}

//*****************************************************************************
//
//! Enables individual I2C Slave interrupt sources.
//!
//! \param base is the base address of the I2C module.
//! \param intFlags is the bit mask of the interrupt sources to be enabled.
//!
//! This function enables the indicated I2C Slave interrupt sources. Only the
//! sources that are enabled can be reflected to the processor interrupt
//! disabled sources have no effect on the processor.
//!
//! The \e intFlags parameter is the logical OR of any of the following:
//!
//! - \b I2C_SLAVE_INT_RX_FIFO_FULL - RX FIFO Full interrupt
//! - \b I2C_SLAVE_INT_TX_FIFO_EMPTY - TX FIFO Empty interrupt
//! - \b I2C_SLAVE_INT_RX_FIFO_REQ - RX FIFO Request interrupt
//! - \b I2C_SLAVE_INT_TX_FIFO_REQ - TX FIFO Request interrupt
//! - \b I2C_SLAVE_INT_TX_DMA_DONE - TX DMA Complete interrupt
//! - \b I2C_SLAVE_INT_RX_DMA_DONE - RX DMA Complete interrupt
//! - \b I2C_SLAVE_INT_STOP - Stop condition detected interrupt
//! - \b I2C_SLAVE_INT_START - Start condition detected interrupt
//! - \b I2C_SLAVE_INT_DATA - Data interrupt
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_enableSlaveIntSource(uint32_t base, uint32_t intFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable the slave interrupt.
    //
    HWREG(base + I2C_O_SIMR) |= intFlags;
}

//*****************************************************************************
//
//! Disables the I2C Master interrupt.
//!
//! \param base is the base address of the I2C module.
//!
//! This function disables the I2C Master interrupt source.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_disableMasterInt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Disable the master interrupt.
    //
    HWREG(base + I2C_O_MIMR) &= ~I2C_MASTER_INT_DATA;
}

//*****************************************************************************
//
//! Disables individual I2C Master interrupt sources.
//!
//! \param base is the base address of the I2C module.
//! \param intFlags is the bit mask of the interrupt sources to be
//!        disabled.
//!
//! This function disables the indicated I2C Master interrupt sources.  Only
//! the sources that are enabled can be reflected to the processor interrupt
//! disabled sources have no effect on the processor.
//!
//! The \e intFlags parameter has the same definition as the
//! \e intFlags parameter to I2C_enableMasterIntSource().
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_disableMasterIntSource(uint32_t base, uint32_t intFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Disable the master interrupt.
    //
    HWREG(base + I2C_O_MIMR) &= ~intFlags;
}

//*****************************************************************************
//
//! Disables the I2C Slave interrupt.
//!
//! \param base is the base address of the I2C module.
//!
//! This function disables the I2C Slave interrupt source.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_disableSlaveInt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Disable the slave interrupt.
    //
    HWREG(base + I2C_O_SIMR) &= ~I2C_SLAVE_INT_DATA;
}

//*****************************************************************************
//
//! Disables individual I2C Slave interrupt sources.
//!
//! \param base is the base address of the I2C module.
//! \param intFlags is the bit mask of the interrupt sources to be
//!        disabled.
//!
//! This function disables the indicated I2C Slave interrupt sources.  Only
//! the sources that are enabled can be reflected to the processor interrupt
//! disabled sources have no effect on the processor.
//!
//! The \e intFlags parameter has the same definition as the
//! \e intFlags parameter to I2C_enableSlaveIntSource().
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_disableSlaveIntSource(uint32_t base, uint32_t intFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Disable the slave interrupt.
    //
    HWREG(base + I2C_O_SIMR) &= ~intFlags;
}

//*****************************************************************************
//
//! Checks if the current I2C Master has any interrupts active.
//!
//! \param base is the base address of the I2C module.
//! \param masked of type I2C_MasterIntType is I2C_MASTER_RAW_INT 
//! if the raw interrupt status is requested and I2C_MASTER_MASKED_INT
//! if the masked interrupt status is requested.
//!
//! This function returns the interrupt status as active or not for the I2C.
//! Either the raw interrupt status or the status of interrupts that are
//! allowed to reflect to the processor can be returned as being active or not
//!
//! \return The current interrupt status, returned as \b true if active
//! or \b false if not active.
//
//*****************************************************************************
static inline bool
I2C_isMasterIntActive(uint32_t base, I2C_MasterIntType masked)
{
    bool ret;
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Return either the interrupt status or the raw interrupt status as
    // requested.
    //
    if(masked)
    {
        ret = ((HWREG(base + I2C_O_MMIS)) ? true : false);
    }
    else
    {
        ret = ((HWREG(base + I2C_O_MRIS)) ? true : false);
    }
    return(ret);
}

//*****************************************************************************
//
//! Gets the current I2C Master interrupt status.
//!
//! \param base is the base address of the I2C module.
//! \param masked of type I2C_MasterIntType is I2C_MASTER_RAW_INT 
//! if the raw interrupt status is requested and I2C_MASTER_MASKED_INT
//! if the masked interrupt status is requested..
//!
//! This function returns the interrupt status for the I2C module.
//! Either the raw interrupt status or the status of interrupts that are
//! allowed to reflect to the processor can be returned.
//!
//! \return Returns the current interrupt status, enumerated as a bit field of
//! values described in I2C_enableMasterIntSource().
//
//*****************************************************************************
static inline uint32_t
I2C_getMasterIntStatus(uint32_t base, I2C_MasterIntType masked)
{
    uint32_t ret;
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Return either the interrupt status or the raw interrupt status as
    // requested.
    //
    if(masked)
    {
        ret = HWREG(base + I2C_O_MMIS);
    }
    else
    {
        ret = HWREG(base + I2C_O_MRIS);
    }
    
    return(ret);
}

//*****************************************************************************
//
//! Gets the current I2C Slave interrupt status.
//!
//! \param base is the base address of the I2C module.
//! \param masked of type I2C_MasterIntType is I2C_MASTER_RAW_INT 
//! if the raw interrupt status is requested and I2C_MASTER_MASKED_INT
//! if the masked interrupt status is requested.
//!
//! This function returns the interrupt status for the I2C Slave.
//! Either the raw interrupt status or the status of interrupts that are
//! allowed to reflect to the processor can be returned.
//!
//! \return The current interrupt status, returned as \b true if active
//! or \b false if not active.
//
//*****************************************************************************
static inline bool
I2C_isSlaveIntActive(uint32_t base, I2C_MasterIntType masked)
{
    bool ret;
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Return either the interrupt status or the raw interrupt status as
    // requested.
    //
    if(masked)
    {
        ret = ((HWREG(base + I2C_O_SMIS)) ? true : false);
    }
    else
    {
        ret = ((HWREG(base + I2C_O_SRIS)) ? true : false);
    }
    
    return(ret);
}

//*****************************************************************************
//
//! Gets the current I2C Slave interrupt status.
//!
//! \param base is the base address of the I2C module.
//! \param bMasked of type I2C_MasterIntType is I2C_MASTER_RAW_INT 
//! if the raw interrupt status is requested and I2C_MASTER_MASKED_INT
//! if the masked interrupt status is requested.
//!
//! This function returns the interrupt status for the I2C Slave.
//! Either the raw interrupt status or the status of interrupts that are
//! allowed to reflect to the processor can be returned.
//!
//! \return Returns the current interrupt status, enumerated as a bit field of
//! values described in I2C_enableSlaveIntSource().
//
//*****************************************************************************
static inline uint32_t
I2C_getSlaveIntStatus(uint32_t base, I2C_MasterIntType masked)
{
    uint32_t ret;
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Return either the interrupt status or the raw interrupt status as
    // requested.
    //
    if(masked)
    {
        ret = HWREG(base + I2C_O_SMIS);
    }
    else
    {
        ret = HWREG(base + I2C_O_SRIS);
    }
    return(ret);
}

//*****************************************************************************
//
//! Clears I2C Master interrupt sources.
//!
//! \param base is the base address of the I2C module.
//!
//! The I2C Master interrupt source is cleared, so that it no longer
//! asserts.  This function must be called in the interrupt handler to keep the
//! interrupt from being triggered again immediately upon exit.
//!
//! \note Because there is a write buffer in the Cortex-M processor, it may
//! take several clock cycles before the interrupt source is actually cleared.
//! Therefore, it is recommended that the interrupt source be cleared early in
//! the interrupt handler(as opposed to the very last action) to astatic inline
//! void returning from the interrupt handler before the interrupt source is
//! actually cleared.  Failure to do so may result in the interrupt handler
//! being immediately reentered (because the interrupt controller still sees
//! the interrupt source asserted).
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_clearMasterInt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Clear the I2C master interrupt source.
    //
    HWREG(base + I2C_O_MICR) = I2C_MICR_IC;

