hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/i2c.h
}

//*****************************************************************************
//
//! Clears I2C Master interrupt sources.
//!
//! \param base is the base address of the I2C module.
//! \param intFlags is a bit mask of the interrupt sources to be cleared.
//!
//! The specified I2C Master interrupt sources are cleared, so that they no
//! longer assert.  This function must be called in the interrupt handler to
//! keep the interrupt from being triggered again immediately upon exit.
//!
//! The \e intFlags parameter has the same definition as the
//! \e intFlags parameter to I2C_enableMasterIntSource().
//!
//! \note Because there is a write buffer in the Cortex-M processor, it may
//! take several clock cycles before the interrupt source is actually cleared.
//! Therefore, it is recommended that the interrupt source be cleared early in
//! the interrupt handler(as opposed to the very last action) to astatic inline
//! void returning from the interrupt handler before the interrupt source is
//! actually cleared. Failure to do so may result in the interrupt handler
//! being immediately reentered (because the interrupt controller still sees
//! the interrupt source asserted).
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_clearMasterIntSource(uint32_t base, uint32_t intFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Clear the I2C master interrupt source.
    //
    HWREG(base + I2C_O_MICR) = intFlags;
}

//*****************************************************************************
//
//! Clears I2C Slave interrupt sources.
//!
//! \param base is the base address of the I2C module.
//!
//! The I2C Slave interrupt source is cleared, so that it no longer asserts.
//! This function must be called in the interrupt handler to keep the interrupt
//! from being triggered again immediately upon exit.
//!
//! \note Because there is a write buffer in the Cortex-M processor, it may
//! take several clock cycles before the interrupt source is actually cleared.
//! Therefore, it is recommended that the interrupt source be cleared early in
//! the interrupt handler(as opposed to the very last action) to astatic inline
//! void returning from the interrupt handler before the interrupt source is
//! actually cleared.  Failure to do so may result in the interrupt handler
//! being immediately reentered (because the interrupt controller still sees
//! the interrupt source asserted).
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_clearSlaveInt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Clear the I2C slave interrupt source.
    //
    HWREG(base + I2C_O_SICR) = I2C_SICR_DATAIC;
}

//*****************************************************************************
//
//! Clears I2C Slave interrupt sources.
//!
//! \param base is the base address of the I2C module.
//! \param intFlags is a bit mask of the interrupt sources to be cleared.
//!
//! The specified I2C Slave interrupt sources are cleared, so that they no
//! longer assert.  This function must be called in the interrupt handler to
//! keep the interrupt from being triggered again immediately upon exit.
//!
//! The \e intFlags parameter has the same definition as the
//! \e intFlags parameter to I2C_enableSlaveIntSource().
//!
//! \note Because there is a write buffer in the Cortex-M processor, it may
//! take several clock cycles before the interrupt source is actually cleared.
//! Therefore, it is recommended that the interrupt source be cleared early in
//! the interrupt handler(as opposed to the very last action) to astatic inline
//! void returning from the interrupt handler before the interrupt source is
//! actually cleared.  Failure to do so may result in the interrupt handler
//! being immediately reentered (because the interrupt controller still sees
//! the interrupt source asserted).
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_clearSlaveIntSource(uint32_t base, uint32_t intFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Clear the I2C slave interrupt source.
    //
    HWREG(base + I2C_O_SICR) = intFlags;
}

//*****************************************************************************
//
//! Sets the address that the I2C Master places on the bus.
//!
//! \param base is the base address of the I2C module.
//! \param slaveAddr 7-bit slave address
//! \param bReceive flag indicating the type of communication with the slave
//!
//! This function configures the address that the I2C Master places on the
//! bus when initiating a transaction.  When the \e bReceive parameter is set
//! to \b I2C_MASTER_READ, the address indicates that the I2C Master is 
//! initiating a read from the slave else set to I2C_MASTER_WRITE the
//! address indicates that the I2C Master is initiating a write to 
//! the slave.This is done using I2C_MasterRW type.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_setSlaveAddress(uint32_t base, uint8_t slaveAddr,
                               I2C_MasterRW bReceive)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));
    ASSERT(!(slaveAddr & I2C_SA_A6_0_MASK));

    //
    // Set the address of the slave with which the master will communicate.
    //
    HWREG(base + I2C_O_MSA) = ((slaveAddr << (uint8_t)I2C_MSA_SA_S) |
                               (uint8_t)bReceive);
}

//*****************************************************************************
//
//! Reads the state of the SDA and SCL pins.
//!
//! \param base is the base address of the I2C module.
//!
//! This function returns the state of the I2C bus by providing the real time
//! values of the SDA and SCL pins.
//!
//! \return Returns the state of the bus with SDA in bit position 1 and SCL in
//! bit position 0.
//
//*****************************************************************************
static inline uint32_t
I2C_getMasterLineState(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Return the line state.
    //
    return(HWREG(base + I2C_O_MBMON));
}

//*****************************************************************************
//
//! Indicates whether or not the I2C Master is busy.
//!
//! \param base is the base address of the I2C module.
//!
//! This function returns an indication of whether or not the I2C Master is
//! busy transmitting or receiving data.
//!
//! \return Returns \b true if the I2C Master is busy; otherwise, returns
//! \b false.
//
//*****************************************************************************
static inline bool
I2C_isMasterBusy(uint32_t base)
{
    bool ret;
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Return the busy status.
    //
    if((HWREG(base + I2C_O_MCS) & I2C_MCS_BUSY) == I2C_MCS_BUSY)
    {
        ret = true;
    }
    else
    {
        ret = false;
    }
    return(ret);
}

//*****************************************************************************
//
//! Indicates whether or not the I2C bus is busy.
//!
//! \param base is the base address of the I2C module.
//!
//! This function returns an indication of whether or not the I2C bus is busy.
//! This function can be used in a multi-master environment to determine if
//! another master is currently using the bus.
//!
//! \return Returns \b true if the I2C bus is busy; otherwise, returns
//! \b false.
//
//*****************************************************************************
static inline bool
I2C_isBusBusy(uint32_t base)
{
    bool ret;
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Return the bus busy status.
    //
    if((HWREG(base + I2C_O_MCS) & I2C_MCS_BUSBSY) == I2C_MCS_BUSBSY)
    {
        ret = true;
    }
    else
    {
        ret = false;
    }
    return(ret);
}

//*****************************************************************************
//
//! Controls the state of the I2C Master.
//!
//! \param base is the base address of the I2C module.
//! \param cmd command to be issued to the I2C Master.
//! This is provided as a I2C_MasterControl Type .
//!
//! This function is used to control the state of the Master send and
//! receive operations.  The \e ui8Cmd parameter can be one of the following
//! values:
//!
//! - \b I2C_MASTER_CMD_SINGLE_SEND
//! - \b I2C_MASTER_CMD_SINGLE_RECEIVE
//! - \b I2C_MASTER_CMD_BURST_SEND_START
//! - \b I2C_MASTER_CMD_BURST_SEND_CONT
//! - \b I2C_MASTER_CMD_BURST_SEND_FINISH
//! - \b I2C_MASTER_CMD_BURST_SEND_ERROR_STOP
//! - \b I2C_MASTER_CMD_BURST_RECEIVE_START
//! - \b I2C_MASTER_CMD_BURST_RECEIVE_CONT
//! - \b I2C_MASTER_CMD_BURST_RECEIVE_FINISH
//! - \b I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP
//! - \b I2C_MASTER_CMD_QUICK_COMMAND
//! - \b I2C_MASTER_CMD_HS_MASTER_CODE_SEND
//! - \b I2C_MASTER_CMD_FIFO_SINGLE_SEND
//! - \b I2C_MASTER_CMD_FIFO_SINGLE_RECEIVE
//! - \b I2C_MASTER_CMD_FIFO_BURST_SEND_START
//! - \b I2C_MASTER_CMD_FIFO_BURST_SEND_CONT
//! - \b I2C_MASTER_CMD_FIFO_BURST_SEND_FINISH
//! - \b I2C_MASTER_CMD_FIFO_BURST_SEND_ERROR_STOP
//! - \b I2C_MASTER_CMD_FIFO_BURST_RECEIVE_START
//! - \b I2C_MASTER_CMD_FIFO_BURST_RECEIVE_CONT
//! - \b I2C_MASTER_CMD_FIFO_BURST_RECEIVE_FINISH
//! - \b I2C_MASTER_CMD_FIFO_BURST_RECEIVE_ERROR_STOP
//!
//! \note Please consult the device data sheet to determine if this
//! feature is supported.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_setMasterConfig(uint32_t base, I2C_MasterControl cmd)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));
    ASSERT((cmd == I2C_MASTER_CMD_SINGLE_SEND) ||
           (cmd == I2C_MASTER_CMD_SINGLE_RECEIVE) ||
           (cmd == I2C_MASTER_CMD_BURST_SEND_START) ||
           (cmd == I2C_MASTER_CMD_BURST_SEND_CONT) ||
           (cmd == I2C_MASTER_CMD_BURST_SEND_FINISH) ||
           (cmd == I2C_MASTER_CMD_BURST_SEND_ERROR_STOP) ||
           (cmd == I2C_MASTER_CMD_BURST_RECEIVE_START) ||
           (cmd == I2C_MASTER_CMD_BURST_RECEIVE_CONT) ||
           (cmd == I2C_MASTER_CMD_BURST_RECEIVE_FINISH) ||
           (cmd == I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP) ||
           (cmd == I2C_MASTER_CMD_QUICK_COMMAND) ||
           (cmd == I2C_MASTER_CMD_FIFO_SINGLE_SEND) ||
           (cmd == I2C_MASTER_CMD_FIFO_SINGLE_RECEIVE) ||
           (cmd == I2C_MASTER_CMD_FIFO_BURST_SEND_START) ||
           (cmd == I2C_MASTER_CMD_FIFO_BURST_SEND_CONT) ||
           (cmd == I2C_MASTER_CMD_FIFO_BURST_SEND_FINISH) ||
           (cmd == I2C_MASTER_CMD_FIFO_BURST_SEND_ERROR_STOP) ||
           (cmd == I2C_MASTER_CMD_FIFO_BURST_RECEIVE_START) ||
           (cmd == I2C_MASTER_CMD_FIFO_BURST_RECEIVE_CONT) ||
           (cmd == I2C_MASTER_CMD_FIFO_BURST_RECEIVE_FINISH) ||
           (cmd == I2C_MASTER_CMD_FIFO_BURST_RECEIVE_ERROR_STOP) ||
           (cmd == I2C_MASTER_CMD_HS_MASTER_CODE_SEND));

    //
    // Send the command.
    //
    HWREG(base + I2C_O_MCS_WRITE) = (uint32_t)cmd;
}
//*****************************************************************************
//
//! Transmits a byte from the I2C Master.
//!
//! \param base is the base address of the I2C module.
//! \param data data to be transmitted from the I2C Master.
//!
//! This function places the supplied data into I2C Master Data Register.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_putMasterData(uint32_t base, uint8_t data)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Write the byte.
    //
    HWREG(base + I2C_O_MDR) = data;
}

//*****************************************************************************
//
//! Receives a byte that has been sent to the I2C Master.
//!
//! \param base is the base address of the I2C module.
//!
//! This function reads a byte of data from the I2C Master Data Register.
//!
//! \return Returns the byte received from by the I2C Master, cast as an
//! uint32_t.
//
//*****************************************************************************
static inline uint32_t
I2C_getMasterData(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Read a byte.
    //
    return(HWREG(base + I2C_O_MDR));
}

//*****************************************************************************
//
//! Sets the Master clock timeout value.
//!
//! \param base is the base address of the I2C module.
//! \param value is the number of I2C clocks before the timeout is
//!        asserted.
//!
//! This function enables and configures the clock low timeout feature in the
//! I2C peripheral.  This feature is implemented as a 12-bit counter, with the
//! upper 8-bits being programmable.  For example, to program a timeout of 20ms
//! with a 100-kHz SCL frequency, \e value is 0x7d.
//!
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_setMasterClkTimeout(uint32_t base, uint32_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Write the timeout value.
    //
    HWREG(base + I2C_O_MCLKOCNT) = value;
}

//*****************************************************************************
//
//! Configures ACK override behaviour of the I2C Slave.
//!
//! \param base is the base address of the I2C module.
//! \param enable enables or disables ACK override using the macros 
//! I2C_SLAVE_ACK_OVERRIDE_ENABLE / I2C_SLAVE_ACK_OVERRIDE_DISABLE 
//!
//! This function enables or disables ACK override, allowing the user
//! application to drive the value on SDA during the ACK cycle.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_configureSlaveAckOverride(uint32_t base, bool enable)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable or disable based on bEnable.
    //
    if(enable)
    {
        HWREG(base + I2C_O_SACKCTL) |= I2C_SACKCTL_ACKOEN;
    }
    else
    {
        HWREG(base + I2C_O_SACKCTL) &= ~I2C_SACKCTL_ACKOEN;
    }
}

//*****************************************************************************
//
//! Writes the ACK value.
//!
//! \param base is the base address of the I2C module.
//! \param ack chooses whether to ACK (true) or NACK (false) the transfer.
//!  using the macros I2C_SLAVE_ACK or I2C_SLAVE_NACK resp.
//!
//! This function puts the desired ACK value on SDA during the ACK cycle.  The
//! value written is only valid when ACK override is enabled using
//! I2C_configureSlaveACK().
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_setSlaveAckValue(uint32_t base, bool ack)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // ACK or NACK based on the value of bACK.
    //
    if(ack)
    {
        HWREG(base + I2C_O_SACKCTL) &= ~I2C_SACKCTL_ACKOVAL;
    }
    else
    {
        HWREG(base + I2C_O_SACKCTL) |= I2C_SACKCTL_ACKOVAL;
    }
}

//*****************************************************************************
//
//! Gets the I2C Slave status
//!
//! \param base is the base address of the I2C module.
//!
//! This function returns the action requested from a master, if any.
//! Possible values are:
//!
//! - \b I2C_SLAVE_ACT_NONE
//! - \b I2C_SLAVE_ACT_RREQ
//! - \b I2C_SLAVE_ACT_TREQ
//! - \b I2C_SLAVE_ACT_RREQ_FBR
//! - \b I2C_SLAVE_ACT_OWN2SEL
//! - \b I2C_SLAVE_ACT_QCMD
//! - \b I2C_SLAVE_ACT_QCMD_DATA
//! - \b I2C_SLAVE_DMA_TX
//! - \b I2C_SLAVE_DMA_RX
//!
//! \return Returns \b I2C_SLAVE_ACT_NONE to indicate that no action has been
//! requested of the I2C Slave, \b I2C_SLAVE_ACT_RREQ to indicate that
//! an I2C master has sent data to the I2C Slave, \b I2C_SLAVE_ACT_TREQ
//! to indicate that an I2C master has requested that the I2C Slave send
//! data, \b I2C_SLAVE_ACT_RREQ_FBR to indicate that an I2C master has sent
//! data to the I2C slave and the first byte following the slave's own address
//! has been received, \b I2C_SLAVE_ACT_OWN2SEL to indicate that the second I2C
//! slave address was matched, \b I2C_SLAVE_ACT_QCMD to indicate that a quick
//! command was received, \b I2C_SLAVE_ACT_QCMD_DATA to indicate that the
//! data bit was set when the quick command was received , \b I2C_SLAVE_DMA_TX
//! to indicate that the DMA TX is active and \b I2C_SLAVE_DMA_RX to indicate 
//! that the DMA RX is active.
//
//*****************************************************************************
static inline uint32_t
I2C_getSlaveStatus(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Return the slave status.
    //
    return(HWREG(base + I2C_O_SCSR));
}

//*****************************************************************************
//
//! Transmits a byte from the I2C Slave.
//!
//! \param base is the base address of the I2C module.
//! \param data is the data to be transmitted from the I2C Slave
//!
//! This function places the supplied data into I2C Slave Data Register.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_putSlaveData(uint32_t base, uint8_t data)
{ 
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Write the byte.
    //
    HWREG(base + I2C_O_SDR) = data;
}

//*****************************************************************************
//
//! Receives a byte that has been sent to the I2C Slave.
//!
//! \param base is the base address of the I2C module.
//!
//! This function reads a byte of data from the I2C Slave Data Register.
//!
//! \return Returns the byte received from by the I2C Slave, cast as an
//! uint32_t.
//
//*****************************************************************************
static inline uint32_t
I2C_getSlaveData(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Read a byte.
    //
    return(HWREG(base + I2C_O_SDR));
}

//*****************************************************************************
//
//! Configures the I2C transmit (TX) FIFO.
//!
//! \param base is the base address of the I2C module.
//! \param config is the configuration of the FIFO.
//! \param trigger is to select the trigger level of TX the FIFO.
//!
//! This configures the I2C peripheral's transmit FIFO.  The transmit FIFO can
//! be used by the master or slave, but not both.  The following macros are
//! used to configure the TX FIFO behaviour for master or slave, with 
//! or without DMA:
//!
//! \b I2C_FIFO_CFG_TX_MASTER, \b I2C_FIFO_CFG_TX_SLAVE,
//! \b I2C_FIFO_CFG_TX_MASTER_DMA, \b I2C_FIFO_CFG_TX_SLAVE_DMA
//!
//! To select the trigger level, one of the following macros should be used:
//!
//! \b I2C_FIFO_CFG_TX_TRIG_1, \b I2C_FIFO_CFG_TX_TRIG_2,
//! \b I2C_FIFO_CFG_TX_TRIG_3, \b I2C_FIFO_CFG_TX_TRIG_4,
//! \b I2C_FIFO_CFG_TX_TRIG_5, \b I2C_FIFO_CFG_TX_TRIG_6,
//! \b I2C_FIFO_CFG_TX_TRIG_7
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_configureTxFIFO(uint32_t base, I2C_TxFIFOCfg config, I2C_TxTrigger trigger)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Clear transmit configuration data.
    //
    HWREG(base + I2C_O_FIFOCTL) &= ~I2C_RXFIFO_MASK;
    
    //
    // Store new transmit configuration data.
    //
    HWREG(base + I2C_O_FIFOCTL) |= ((uint32_t)config | (uint32_t)trigger);
}

//*****************************************************************************
//
//! Flushes the transmit (TX) FIFO.
//!
//! \param base is the base address of the I2C module.
//!
//! This function flushes the I2C transmit FIFO.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_flushTxFIFO(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Flush the TX FIFO.
    //
    HWREG(base + I2C_O_FIFOCTL) |= I2C_FIFOCTL_TXFLUSH;
}

//*****************************************************************************
//
//! Configures the I2C receive (RX) FIFO.
//!
//! \param base is the base address of the I2C module.
//! \param config is the configuration of the FIFO using specified macros.
//! \param trigger is to select the trigger level of RX the FIFO.
//!
//! This configures the I2C peripheral's receive FIFO.  The receive FIFO can be
//! used by the master or slave, but not both.  The following macros are used
//! to configure the RX FIFO behaviour for master or slave,with or without DMA:
//!
//! \b I2C_FIFO_CFG_RX_MASTER, \b I2C_FIFO_CFG_RX_SLAVE,
//! \b I2C_FIFO_CFG_RX_MASTER_DMA, \b I2C_FIFO_CFG_RX_SLAVE_DMA
//!
//! To select the trigger level, one of the following macros should be used:
//!
//! \b I2C_FIFO_CFG_RX_TRIG_1, \b I2C_FIFO_CFG_RX_TRIG_2,
//! \b I2C_FIFO_CFG_RX_TRIG_3, \b I2C_FIFO_CFG_RX_TRIG_4,
//! \b I2C_FIFO_CFG_RX_TRIG_5, \b I2C_FIFO_CFG_RX_TRIG_6,
//! \b I2C_FIFO_CFG_RX_TRIG_7
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_configureRxFIFO(uint32_t base, I2C_RxFIFOCfg config, I2C_RxTrigger trigger)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Clear receive configuration data.
    //
    HWREG(base + I2C_O_FIFOCTL) &= ~(I2C_RXFIFO_MASK << 16U);

    //
    // Store new receive configuration data.
    //
    HWREG(base + I2C_O_FIFOCTL) |= ((uint32_t)config | (uint32_t)trigger);
}

//*****************************************************************************
//
//! Flushes the receive (RX) FIFO.
//!
//! \param base is the base address of the I2C module.
//!
//! This function flushes the I2C receive FIFO.
//!
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_flushRxFIFO(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Flush the RX FIFO.
    //
    HWREG(base + I2C_O_FIFOCTL) |= I2C_FIFOCTL_RXFLUSH;
}

//*****************************************************************************
//
//! Gets the TX FIFO status.
//!
//! \param base is the base address of the I2C module.
//!
//! This function retrieves the status for the transmit (TX) FIFO.
//! The trigger level for the transmit FIFO is set using I2C_setTxFIFOConfig().
//!
//! \return Returns the FIFO status, enumerated as a bit field containing
//! \b I2C_FIFO_TX_BELOW_TRIG_LEVEL, \b I2C_FIFO_TX_FULL, and
//! \b I2C_FIFO_TX_EMPTY.
//
//*****************************************************************************
static inline uint32_t
I2C_getTxFIFOStatus(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Get the TX FIFO status
    //
    return(HWREGH(base + I2C_O_FIFOSTATUS) & I2C_FIFOSTATUS_TX_M);
}

