hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/i2c.h
//*****************************************************************************
//
//! Gets the RX FIFO status.
//!
//! \param base is the base address of the I2C module.
//!
//! This function retrieves the status for the receive (RX) FIFO.  
//! The trigger level for the receive FIFO is set using I2C_setRxFIFOConfig(). 
//!
//! \return Returns the FIFO status, enumerated as a bit field containing
//! \b I2C_FIFO_RX_BELOW_TRIG_LEVEL, \b I2C_FIFO_RX_FULL, 
//! and \b I2C_FIFO_RX_EMPTY.
//
//*****************************************************************************
static inline uint32_t
I2C_getRxFIFOStatus(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Get the RX FIFO status
    //
    return(HWREGH(base + I2C_O_FIFOSTATUS) & I2C_FIFOSTATUS_RX_M);
                           
}

//*****************************************************************************
//
//! Writes a data byte to the I2C transmit FIFO.
//!
//! \param base is the base address of the I2C module.
//! \param data is the data to be placed into the transmit FIFO.
//!
//! This function adds a byte of data to the I2C transmit FIFO.  If there is
//! no space available in the FIFO,  this function waits for space to become
//! available before returning.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_putFIFOData(uint32_t base, uint8_t data)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Wait until there is space.
    //
    while((HWREG(base + I2C_O_FIFOSTATUS) &
           I2C_FIFOSTATUS_TXFF) == I2C_FIFOSTATUS_TXFF)
    {
    }

    //
    // Place data into the FIFO.
    //
    HWREG(base + I2C_O_FIFODATATX)= data;
}

//*****************************************************************************
//
//! Writes a data byte to the I2C transmit FIFO.
//!
//! \param base is the base address of the I2C module.
//! \param data is the data to be placed into the transmit FIFO.
//!
//! This function adds a byte of data to the I2C transmit FIFO.  If there is
//! no space available in the FIFO, this function returns a zero.
//!
//! \return The number of elements added to the I2C transmit FIFO.
//
//*****************************************************************************
static inline uint32_t
I2C_putFIFODataNonBlocking(uint32_t base, uint8_t data)
{
    uint32_t ret;
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // If FIFO is full, return zero.
    //
    if((HWREG(base + I2C_O_FIFOSTATUS) &
        I2C_FIFOSTATUS_TXFF) == I2C_FIFOSTATUS_TXFF)
    {
        ret = 0U;
    }
    else
    {
        HWREG(base + I2C_O_FIFODATATX)= data;
        ret = 1U;
    }
    return(ret);
}

//*****************************************************************************
//
//! Reads a byte from the I2C receive FIFO.
//!
//! \param base is the base address of the I2C module.
//!
//! This function reads a byte of data from I2C receive FIFO and places it in
//! the location specified by the \e pdata parameter.  If there is no data
//! available, this function waits until data is received before returning.
//!
//! \return The data byte.
//
//*****************************************************************************
static inline uint32_t
I2C_getFIFOData(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Wait until there is data to read.
    //
    while((HWREG(base + I2C_O_FIFOSTATUS) &
          I2C_FIFOSTATUS_RXFE) == I2C_FIFOSTATUS_RXFE)
    {
    }

    //
    // Read a byte.
    //
    return(HWREG(base + I2C_O_FIFODATARX));
}

//*****************************************************************************
//
//! Reads a byte from the I2C receive FIFO.
//!
//! \param base is the base address of the I2C module.
//! \param pdata is a pointer where the read data is stored.
//!
//! This function reads a byte of data from I2C receive FIFO and places it in
//! the location specified by the \e pdata parameter.  If there is no data
//! available, this functions returns 0.
//!
//! \return The number of elements read from the I2C receive FIFO.
//
//*****************************************************************************
static inline uint32_t
I2C_getFIFODataNonBlocking(uint32_t base, uint8_t *dataptr)
{
    uint32_t ret;
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // If nothing in the FIFO, return zero.
    //
    if((HWREG(base + I2C_O_FIFOSTATUS) & 
        I2C_FIFOSTATUS_RXFE) == I2C_FIFOSTATUS_RXFE)
    {
        ret = 0U;
    }
    else
    {
        *dataptr = HWREG(base + I2C_O_FIFODATARX);
        ret = 1U;
    }
    return(ret);
}

//*****************************************************************************
//
//! Set the burst length for a I2C master FIFO operation.
//!
//! \param base is the base address of the I2C module.
//! \param length is the length of the burst transfer.
//!
//! This function configures the burst length for a I2C Master FIFO operation.
//! The burst field is limited to 8 bits or 256 bytes.  The burst length
//! applies to a single I2CMCS BURST operation meaning that it specifies the
//! burst length for only the current operation (can be TX or RX).  Each burst
//! operation must configure the burst length prior to writing the BURST bit
//! in the I2CMCS using I2C_controlMaster().
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_setMasterBurstLength(uint32_t base, uint8_t length)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base) && (length < 256U));

    //
    // Set the burst length.
    //
    HWREG(base + I2C_O_MBLEN) = length;
}

//*****************************************************************************
//
//! Returns the current value of the burst transfer counter.
//!
//! \param base is the base address of the I2C module.
//!
//! This function returns the current value of the burst transfer counter that
//! is used by the FIFO mechanism.  Software can use this value to determine
//! how many bytes remain in a transfer, or where in the transfer the burst
//! operation was if an error has occurred.
//!
//! \return None.
//
//*****************************************************************************
static inline uint32_t
I2C_getMasterBurstCount(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Get burst count.
    //
    return(HWREG(base + I2C_O_MBCNT));
}

//*****************************************************************************
//
//! Enables FIFO usage for the I2C Slave.
//!
//! \param base is the base address of the I2C module.
//! \param config is the desired FIFO configuration of the I2C Slave.
//!
//! This function configures the I2C Slave to use the FIFO(s).  This
//! function should be used in combination with I2C_setTxFIFOConfig() and/or
//! I2C_setRxFIFOConfig(), which configure the FIFO trigger level and tell
//! the FIFO hardware whether to interact with the I2C Master or Slave.  The
//! application appropriate combination of \b I2C_SLAVE_TX_FIFO_ENABLE and
//! \b I2C_SLAVE_RX_FIFO_ENABLE should be passed in to the \e config
//! field.
//!
//! The Slave I2CSCSR register is write-only, so any call to I2C_enableSlave(),
//! I2C_disableSlave or I2C_enableSlaveFIFO() overwrites the slave
//! configuration.Therefore, application software should call I2C_enableSlave()
//!  followed by I2C_enableSlaveFIFO() with the desired FIFO configuration.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_enableFIFO(uint32_t base, uint32_t config)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable the FIFOs for the slave.
    //
    HWREG(base + I2C_O_SCSR_WRITE) = config | I2C_SCSR_WRITE_DA;
}

//*****************************************************************************
//
//! Disable FIFO usage for the I2C Slave.
//!
//! \param base is the base address of the I2C module.
//!
//! This function disables the FIFOs for the I2C Slave.  After calling this
//! this function, the FIFOs are disabled, but the Slave remains active.
//!
//! \return None.
//
//*****************************************************************************
static inline void
I2C_disableFIFO(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Disable slave FIFOs.
    //
    HWREG(base + I2C_O_SCSR_WRITE) = I2C_SCSR_WRITE_DA;
}

//*****************************************************************************
//
//! Enables internal loopback mode for an I2C port.
//!
//! \param base is the base address of the I2C module.
//!
//! This function configures an I2C port in internal loopback mode to help with
//! diagnostics and debug.  In this mode, the SDA and SCL signals from master
//! and slave modules are internally connected.  This allows data to be
//! transferred between the master and slave modules of the same I2C port,
//! without having to go through I/O's.I2C_putMasterData(),I2C_putSlaveData(),
//! I2C_getMasterData(),I2C_getSlaveData()can be used along with this function.
//!
//! \return None.
//
//*****************************************************************************
static inline void I2C_enableLoopback(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Write the loopback enable bit to the register.
    //
    HWREG(base + I2C_O_MCR) |= I2C_MCR_LPBK;
}

//*****************************************************************************
//
//! Disables internal loopback mode for an I2C port.
//!
//! \param base is the base address of the I2C module.
//!
//! This function disables the internal loopback mode in an I2C port 
//! In this mode, the SDA and SCL signals from the master and slave 
//! modules are not internally connected. Loopback mode is disabled by 
//! default after reset. 
//!
//! \return None.
//
//*****************************************************************************
static inline void I2C_disableLoopback(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Clear the bit that enables loopback mode.
    //
    HWREG(base + I2C_O_MCR) &= ~I2C_MCR_LPBK;
}

//*****************************************************************************
//
//! Registers an interrupt handler for the I2C module.
//!
//! \param interruptNum specifies the interrupt in question.
//! \param pfnHandler is a pointer to the function to be called when the
//! I2C interrupt occurs.
//!
//! This function sets the handler to be called when an I2C interrupt occurs.
//! This function enables the global interrupt in the interrupt controller
//! specific I2C interrupts must be enabled via I2C_enableMasterInt() and
//! I2C_enableSlaveInt().  If necessary, it is the interrupt handler's
//! responsibility to clear the interrupt source via I2C_clearMasterInt() and
//! I2C_clearSlaveInt().
//!
//! \sa IntRegister() for important information about registering interrupt
//! handlers.
//!
//! \return None.
//
//*****************************************************************************

static inline void
I2C_registerInt(uint32_t interruptNum, void (*pfnHandler)(void))
{
    //
    // Register the interrupt handler, returning an error if an error occurs.
    //
    Interrupt_registerHandler(interruptNum, pfnHandler);

    //
    // Enable the I2C interrupt.
    //
    Interrupt_enable(interruptNum);
}

//*****************************************************************************
//
//! Unregisters an interrupt handler for the I2C module.
//!
//! \param interruptNum specifies the interrupt in question.
//!
//! This function clears the handler to be called when an I2C interrupt
//! occurs.  This function also masks off the interrupt in the interrupt 
//! controller so that the interrupt handler no longer is called.
//!
//! \sa IntRegister() for important information about registering interrupt
//! handlers.
//!
//! \return None.
//
//*****************************************************************************

static inline void
I2C_unregisterInt(uint32_t interruptNum)
{

    //
    // Disable the interrupt.
    //
    Interrupt_disable(interruptNum);

    //
    // Unregister the interrupt handler.
    //
    Interrupt_unregisterHandler(interruptNum);
}


//*****************************************************************************
//
//! Configures the I2C Master glitch filter.
//!
//! \param base is the base address of the I2C module.
//! \param config is the glitch filter configuration provided 
//! by I2C_GlitchFilter type
//!
//! This function configures the I2C Master glitch filter.  The value passed in
//! to \e config determines the sampling range of the glitch filter, which
//! is configurable between 1 and 31 system clock cycles.  The default
//! configuration of the glitch filter is 0 system clock cycles, which means
//! that it's disabled.
//!
//! The \e config field should be any of the following values:
//!
//! - \b I2C_MASTER_GLITCH_FILTER_DISABLED
//! - \b I2C_MASTER_GLITCH_FILTER_1
//! - \b I2C_MASTER_GLITCH_FILTER_2
//! - \b I2C_MASTER_GLITCH_FILTER_3
//! - \b I2C_MASTER_GLITCH_FILTER_4
//! - \b I2C_MASTER_GLITCH_FILTER_8
//! - \b I2C_MASTER_GLITCH_FILTER_16
//! - \b I2C_MASTER_GLITCH_FILTER_31
//!
//!
//! \return None.
//
//*****************************************************************************

static inline void
I2C_configureMasterGlitchFilter(uint32_t base, I2C_GlitchFilter config)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Configure the glitch filter field of MTPR 
    //
    HWREG(base + I2C_O_MTPR) |= (uint32_t)config;
}

//*****************************************************************************
//
//! Initializes the I2C Master block.
//!
//! \param base is the base address of the I2C module.
//! \param i2cClk is the rate of the clock supplied to the I2C module.
//! It should be provided as I2C_CLK_FREQ using the updated clk rate
//! \param fast set up for fast data transfers.
//!
//! This function initializes operation of the I2C Master block by configuring
//! the bus speed for the master and enabling the I2C Master block.
//!
//! If the parameter \e fast is \b true, then the master block is set up to
//! transfer data at 400 Kbps; otherwise, it is set up to transfer data at
//! 100 Kbps.  If Fast Mode Plus (1 Mbps) is desired, software should manually
//! write the I2CMTPR after calling this function.  For High Speed (3.4 Mbps)
//! mode, a specific command is used to switch to the faster clocks after the
//! initial communication with the slave is done at either 100 Kbps or
//! 400 Kbps.
//!
//! The peripheral clock is the same as the processor clock. 
//!
//! \return None.
//
//*****************************************************************************

extern void 
I2C_initMaster(uint32_t base, uint32_t i2cClk,
               bool fast);

//*****************************************************************************
//
//! Sets the I2C slave address.
//!
//! \param base is the base address of the I2C module.
//! \param addrNum determines which slave address is set.
//! This should be provided as I2C_SlaveAddrmode type for Primary or Secondary 
//! \param slaveAddr is the 7-bit slave address
//!
//! This function writes the specified slave address.  The \e addrNum field
//! dictates which slave address is configured.  For example, a value of 
//! I2C_SLAVE_ADDR_PRIMARY configures the primary address and a 
//! value of I2C_SLAVE_ADDR_SECONDARY configures the secondary.
//!
//! \return None.
//
//*****************************************************************************

extern void 
I2C_setOwnSlaveAddress(uint32_t base, I2C_SlaveAddrmode addrNum,
                       uint8_t slaveAddr);

//*****************************************************************************
//
//! Gets the error status of the I2C Master.
//!
//! \param base is the base address of the I2C module.
//!
//! This function is used to obtain the error status of the Master send
//! and receive operations.
//!
//! \return Returns the error status, as one of \b I2C_MASTER_ERR_NONE,
//! \b I2C_MASTER_ERR_ADDR_ACK, \b I2C_MASTER_ERR_DATA_ACK, 
//! \b I2C_MASTER_ERR_ARB_LOST or \b I2C_MASTER_ERR_CLK_TOUT .
//
//*****************************************************************************

extern uint32_t 
I2C_getMasterErr(uint32_t base);

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // I2C_H
